{"class_name": "Sequential", "keras_version": "2.0.5", "config": [{"class_name": "Embedding", "config": {"dtype": "int32", "input_length": 100, "input_dim": 7961, "activity_regularizer": null, "mask_zero": false, "name": "embedding_1", "embeddings_regularizer": null, "trainable": true, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "batch_input_shape": [null, 100], "output_dim": 150}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv1d_1", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "filters": 128, "trainable": true, "kernel_size": [1], "strides": [1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv1d_2", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "filters": 128, "trainable": true, "kernel_size": [2], "strides": [1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv1d_3", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "filters": 128, "trainable": true, "kernel_size": [3], "strides": [1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 200, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 1, "name": "dense_2", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null}}], "backend": "tensorflow"}