{"config": [{"config": {"embeddings_regularizer": null, "input_dim": 7961, "dtype": "int32", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "name": "embedding_1", "batch_input_shape": [null, 100], "output_dim": 150, "embeddings_constraint": null, "input_length": 100, "mask_zero": false, "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"return_state": false, "unit_forget_bias": true, "bias_constraint": null, "stateful": false, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_regularizer": null, "return_sequences": false, "recurrent_regularizer": null, "activation": "tanh", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1", "units": 150, "unroll": false, "implementation": 0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.5"}